[
  {
    "id": "10",
    "url": "/images/RegExp.png",
    "title": "RegExpIt",
    "description": "After discovering the power of regular expressions and how confusing it was, I wanted to create a tool to help generate expressions quickly. The app was built with NextJS, utilising OpenAI's GPT to generate the expressions. The user enters a prompt and the app will generate a regular expression, explain it and give an example. The tool is trained to respond for Javascript, but users can also enter their own custom training data.",
    "alt": "RegExpIt",
    "deployed": "https://reg-exp.vercel.app/",
    "github": "https://github.com/Gavinpiy/RegExp"
  },
  {
    "id": "1",
    "url": "/images/Nesst.png",
    "title": "Nesst",
    "description": "Four week project to develop a property rental platform with an emphasis on community. We worked with stakeholders to bring their vision to life. The app was created with NextJS and includes realtime messaging to allow users to communicate with each other. ",
    "alt": "Nesst project",
    "deployed": "https://nesst.vercel.app/",
    "github": "https://github.com/tplatt92/nesst"
  },

  {
    "id": "3",
    "url": "/images/Stickman.png",
    "title": "Stickman",
    "description": "A simple app built with JavaScript, HTML and CSS. The app allows users to change the height and weight of the stickman with some hidden easter eggs. The goal of the app was to help practice dom manipulation in addition to some basic CSS styling.",
    "alt": "Stickman",
    "deployed": "https://stick-man.vercel.app/",
    "github": "https://github.com/Gavinpiy/StickMan"
  },
  {
    "id": "2",
    "url": "/images/Revision.png",
    "title": "Revision Tool",
    "description": "One week project to create a revision tool for bootcampers. The app was built with JS, HTML, CSS and a custom SQL database API deployed on render. Please allow a couple of minutes for teh backend to fire up! The app also includes score tracker with colour changes with accessibility in mind.",
    "alt": "Revision Tool",
    "deployed": "https://bc15-w8-project-front-end-tech-ti-tens-tau.vercel.app/",
    "github": "https://github.com/SchoolOfCode/bc15-w8-project-front-end-tech-ti-tens"
  },
  {
    "id": "4",
    "url": "/images/Dictionary.png",
    "title": "Dictionary",
    "description": "A very early project to practice using APIs. The app was built with JS, HTML and CSS. The app allows users to search for a word and returns the definition. This project helped with practising fetching and processing some JSON data.",
    "alt": "Dictionary",
    "deployed": "https://bc15-w3-recap-task-fetch-challenge-gavinpiy.vercel.app/",
    "github": "https://github.com/SchoolOfCode/bc15-w3-recap-task-fetch-challenge-Gavinpiy"
  },

  {
    "id": "6",
    "url": "/images/Pokemon.png",
    "title": "PokemonCatcher",
    "description": "Another early project to practice using APIs and my first attempt at using react. The app is very simple with just a button for users to click. Once clicked a random pokemon is fetched and the sprite image is displayed.",
    "alt": "Pokemon",
    "deployed": "https://pokemonreact.vercel.app/",
    "github": "https://github.com/Gavinpiy/pokemonreact"
  }
]
